# 2회

## 1유형

In [29]:
import pandas as pd
df = pd.read_csv("./ch2_data/members.csv")
df

      id    age city    f1  f2      f3    f4         f5  subscribed   views
0   id01    2.0   서울   NaN   0    gold  ENFJ  91.297791  2021-07-16  6820.0
1   id02    9.0   서울  70.0   1     NaN  ENFJ  60.339826  2021-05-12  2534.0
2   id03   27.0   서울  61.0   1    gold  ISTJ  17.252986  2021-03-16  7312.0
3   id04   75.0   서울   NaN   2     NaN  INFP  52.667078  2021-07-21   493.0
4   id05   24.0   서울  85.0   2     NaN  ISFJ  29.269869  2021-03-07  1338.0
..   ...    ...  ...   ...  ..     ...   ...        ...         ...     ...
95  id95   77.0   경기  43.0   1    gold  INTJ  91.297791  2021-05-21  8697.0
96  id96   92.0   경기  53.0   1  silver  ENTJ  52.667078  2021-05-06  4336.0
97  id97  100.0   경기   NaN   0    gold  INFP  67.886373  2021-03-18  6687.0
98  id98   39.0   경기  58.0   2     NaN  INFP  98.429899  2021-10-02   865.0
99  id99    1.0   경기  47.0   0    gold  ESFJ  97.381034  2021-12-02  6090.0

[100 rows x 10 columns]

In [35]:
df = df.sort_values('views',ascending=False)
min_value = df['views'][:10].min()
min_value
df.iloc[:10,-1] = min_value

In [36]:
cond1 = df['age']>=80
print(round(df[cond1]['views'].mean(),2))

5665.57

<hr>

In [45]:
df = pd.read_csv('./ch2_data/members.csv')

In [46]:
num_lines= int(len(df)*0.8)
df = df[:num_lines]
df

      id   age city    f1  f2    f3    f4         f5  subscribed   views
0   id01   2.0   서울   NaN   0  gold  ENFJ  91.297791  2021-07-16  6820.0
1   id02   9.0   서울  70.0   1   NaN  ENFJ  60.339826  2021-05-12  2534.0
2   id03  27.0   서울  61.0   1  gold  ISTJ  17.252986  2021-03-16  7312.0
3   id04  75.0   서울   NaN   2   NaN  INFP  52.667078  2021-07-21   493.0
4   id05  24.0   서울  85.0   2   NaN  ISFJ  29.269869  2021-03-07  1338.0
..   ...   ...  ...   ...  ..   ...   ...        ...         ...     ...
75  id75  63.0   경기  47.0   0  gold  ESTP  20.129444  2021-06-12  6779.0
76  id76  71.0   경기  12.0   0   NaN  ENTJ  83.685380  2021-07-28  2872.0
77  id77  77.0   경기  31.0   0   NaN  INFP  98.429899  2021-01-16  1518.0
78  id78  92.0   경기  96.0   1  gold  INTJ  69.730313  2021-10-27  7565.0
79  id79  30.0   경기   NaN   0  gold  INTJ  80.138280  2021-08-14  8777.0

[80 rows x 10 columns]

In [50]:
std1 = df['f1'].std()


median = df['f1'].median()
df['f1'].fillna(median, inplace=True)
std2 = df['f1'].std()

result = abs(std1-std2)

print(round(result,2))

3.56

/var/folders/6c/5zw1q8hx6r51frqls4xy7vdc0000gn/T/ipykernel_9585/318606718.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['f1'].fillna(median, inplace=True)

<hr>

In [51]:
import pandas as pd
df = pd.read_csv("./ch2_data/members.csv")

In [55]:
age_std = df['age'].std()
age_mean = df['age'].mean()

In [56]:
lower= age_mean - (1.5*age_std)
upper= age_mean + (1.5*age_std)

In [58]:
cond1 = df['age']<lower
cond2 = df['age']>upper

print(df[cond1|cond2]['age'].sum())

473.5

<hr>

In [60]:
import pandas as pd

X_tr = pd.read_csv('./ch2_data/X_train.csv')
y_tr = pd.read_csv('./ch2_data/y_train.csv')
X_val = pd.read_csv('./ch2_data/X_test.csv')

In [68]:
from sklearn.preprocessing import LabelEncoder
cols = X_tr.select_dtypes('O').columns

for col in cols:
    le = LabelEncoder()
    X_tr[col] = le.fit_transform(X_tr[col])
    X_val[col] = le.transform(X_val[col])

In [70]:
X_tr = X_tr.drop('ID',axis=1)
X_test_id = X_val.pop('ID')

In [71]:
from sklearn.model_selection import train_test_split
X_tr,X_val,y_tr,y_val = train_test_split(
    X_tr, y_tr['Reached.on.Time_Y.N'],
    test_size = 0.2, random_state=0
)

In [76]:
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import roc_auc_score

In [85]:
lr = LogisticRegression()
model = lr.fit(X_tr,y_tr)
pred = lr.predict_proba(X_val)

print(roc_auc_score(y_val,pred[:,1]))

0.7294862508383635

/Users/gihyun/Desktop/dev/GitHub/-BigDataAnalyst/.venv/lib/python3.13/site-packages/sklearn/linear_model/_logistic.py:473: ConvergenceWarning: lbfgs failed to converge after 100 iteration(s) (status=1):
STOP: TOTAL NO. OF ITERATIONS REACHED LIMIT

Increase the number of iterations to improve the convergence (max_iter=100).
You might also want to scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

<hr>

In [95]:
import pandas as pd
df = pd.read_csv("./ch3_data/members.csv")
df

      id    age city    f1  f2      f3    f4         f5  subscribed   views
0   id01    2.0   서울   NaN   0    gold  ENFJ  91.297791  2021-07-16  6820.0
1   id02    9.0   서울  70.0   1     NaN  ENFJ  60.339826  2021-05-12  2534.0
2   id03   27.0   서울  61.0   1    gold  ISTJ  17.252986  2021-03-16  7312.0
3   id04   75.0   서울   NaN   2     NaN  INFP  52.667078  2021-07-21   493.0
4   id05   24.0   서울  85.0   2     NaN  ISFJ  29.269869  2021-03-07  1338.0
..   ...    ...  ...   ...  ..     ...   ...        ...         ...     ...
95  id95   77.0   경기  43.0   1    gold  INTJ  91.297791  2021-05-21  8697.0
96  id96   92.0   경기  53.0   1  silver  ENTJ  52.667078  2021-05-06  4336.0
97  id97  100.0   경기   NaN   0    gold  INFP  67.886373  2021-03-18  6687.0
98  id98   39.0   경기  58.0   2     NaN  INFP  98.429899  2021-10-02   865.0
99  id99    1.0   경기  47.0   0    gold  ESFJ  97.381034  2021-12-02  6090.0

[100 rows x 10 columns]

In [96]:
df.dropna(inplace=True)

In [97]:
num_lines = int(len(df)*0.7)

In [99]:
df = df.iloc[:num_lines]

In [104]:
result = df['f1'].quantile(0.25)
print(int(result))

57

<hr>

In [108]:
import pandas as pd
df = pd.read_csv('./ch3_data/year.csv', index_col='Unnamed: 0')

In [120]:
df

,0,1,2,3,4,5,6,7,8,9,...,190,191,192,193,194,195,196,197,198,199
1999,137,74,114,140,80,150,16,133,178,181,...,124,94,118,12,50,191,137,174,56,128
2000,176,87,64,110,128,16,8,4,123,87,...,59,22,3,108,17,104,101,161,156,43
2001,128,132,123,112,134,160,180,47,115,155,...,160,111,116,75,48,51,81,101,194,73

In [125]:
df = df.T

In [130]:
m = df[2000].mean()
print(sum(df[2000]>m))

100

<hr>

In [131]:
import pandas as pd
df = pd.read_csv("./ch3_data/members.csv")
df

      id    age city    f1  f2      f3    f4         f5  subscribed   views
0   id01    2.0   서울   NaN   0    gold  ENFJ  91.297791  2021-07-16  6820.0
1   id02    9.0   서울  70.0   1     NaN  ENFJ  60.339826  2021-05-12  2534.0
2   id03   27.0   서울  61.0   1    gold  ISTJ  17.252986  2021-03-16  7312.0
3   id04   75.0   서울   NaN   2     NaN  INFP  52.667078  2021-07-21   493.0
4   id05   24.0   서울  85.0   2     NaN  ISFJ  29.269869  2021-03-07  1338.0
..   ...    ...  ...   ...  ..     ...   ...        ...         ...     ...
95  id95   77.0   경기  43.0   1    gold  INTJ  91.297791  2021-05-21  8697.0
96  id96   92.0   경기  53.0   1  silver  ENTJ  52.667078  2021-05-06  4336.0
97  id97  100.0   경기   NaN   0    gold  INFP  67.886373  2021-03-18  6687.0
98  id98   39.0   경기  58.0   2     NaN  INFP  98.429899  2021-10-02   865.0
99  id99    1.0   경기  47.0   0    gold  ESFJ  97.381034  2021-12-02  6090.0

[100 rows x 10 columns]

In [134]:
values = df.isnull().sum()

In [135]:
values.idxmax()

'f1'

<hr>

In [140]:
import pandas as pd
train = pd.read_csv("./ch3_data/train.csv")
test = pd.read_csv("./ch3_data/test.csv")

In [137]:
train.shape, test.shape

((1490, 10), (497, 9))

In [142]:
train

,Unnamed: 0,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad,TravelInsurance
0,888,28,Private Sector/Self Employed,Yes,1250000,6,1,No,No,0
1,1308,31,Private Sector/Self Employed,Yes,1250000,7,1,No,No,0
2,151,29,Private Sector/Self Employed,Yes,1200000,7,0,No,No,1
3,396,33,Government Sector,Yes,650000,6,1,No,No,1
4,135,28,Private Sector/Self Employed,Yes,800000,6,0,No,Yes,1
...,...,...,...,...,...,...,...,...,...,...
1485,1713,28,Private Sector/Self Employed,Yes,800000,4,0,No,No,0
1486,624,34,Private Sector/Self Employed,Yes,1000000,9,0,No,No,0
1487,173,26,Private Sector/Self Employed,Yes,450000,5,1,No,No,1
1488,1244,25,Private Sector/Self Employed,No,1150000,3,1,No,Yes,0
1489,893,31,Government Sector,Yes,400000,2,0,No,No,0

In [143]:
target = train.pop("TravelInsurance")

In [144]:
train = pd.get_dummies(train)
test = pd.get_dummies(test)

In [150]:
from sklearn.model_selection import train_test_split
X_tr,X_val,y_tr,y_val = train_test_split(
    train,target, test_size = 0.2, random_state=0
)

In [151]:
from sklearn.metrics import roc_auc_score
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier

In [154]:
rf = RandomForestClassifier()
model = rf.fit(X_tr,y_tr)
pred = rf.predict_proba(X_val)
print(roc_auc_score(y_val,pred[:,1]))

0.8507309941520467

<hr>

## 4회

In [156]:
import pandas as pd
df = pd.read_csv('./ch4_data/data4-1.csv')

In [157]:
q1 = df['age'].quantile(0.25)
q3 = df['age'].quantile(0.75)

print(int(abs(q1-q3)))

50

<hr>

In [180]:
import pandas as pd
df = pd.read_csv('./ch4_data/data4-2.csv')
df

,id,type,reactions,comments,shares,likes,loves,wows,hahas,sads,angrys
0,1,video,529,512,262,432,92,3,1,1,0
1,2,photo,150,0,0,150,0,0,0,0,0
2,3,video,227,236,57,204,21,1,1,0,0
3,4,photo,111,0,0,111,0,0,0,0,0
4,5,photo,213,0,0,204,9,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...
7045,7046,photo,89,0,0,89,0,0,0,0,0
7046,7047,photo,16,0,0,14,1,0,1,0,0
7047,7048,photo,2,0,0,1,1,0,0,0,0
7048,7049,photo,351,12,22,349,2,0,0,0,0
7049,7050,photo,17,0,0,17,0,0,0,0,0

In [181]:
cond1 = (df['likes']+df['wows']) / df['reactions'] >0.4
cond2 = (df['likes']+df['wows']) / df['reactions'] <0.5

In [186]:
len(df[cond1&cond2])

26

In [183]:
len(df[cond1&cond2&cond3])

26

<HR>

In [187]:
import pandas as pd
df = pd.read_csv('./ch4_data/data4-3.csv')
df

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries"
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act..."
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV"
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ..."
...,...,...,...,...,...,...,...,...,...,...,...
8802,s8803,Movie,Zodiac,David Fincher,"Mark Ruffalo, Jake Gyllenhaal, Robert Downey J...",United States,"November 20, 2019",2007,R,158 min,"Cult Movies, Dramas, Thrillers"
8803,s8804,TV Show,Zombie Dumb,NaN,NaN,NaN,"July 1, 2019",2018,TV-Y7,2 Seasons,"Kids' TV, Korean TV Shows, TV Comedies"
8804,s8805,Movie,Zombieland,Ruben Fleischer,"Jesse Eisenberg, Woody Harrelson, Emma Stone, ...",United States,"November 1, 2019",2009,R,88 min,"Comedies, Horror Movies"
8805,s8806,Movie,Zoom,Peter Hewitt,"Tim Allen, Courteney Cox, Chevy Chase, Kate Ma...",United States,"January 11, 2020",2006,PG,88 min,"Children & Family Movies, Comedies"
8806,s8807,Movie,Zubaan,Mozez Singh,"Vicky Kaushal, Sarah-Jane Dias, Raaghav Chanan...",India,"March 2, 2019",2015,TV-14,111 min,"Dramas, International Movies, Music & Musicals"

In [189]:
df['date_added'] = pd.to_datetime(df['date_added'])

In [191]:
df['year'] = df['date_added'].dt.year

In [193]:
df['month'] = df['date_added'].dt.month

In [196]:
cond1 = df['year'] == 2018
cond2 = df['month'] == 1
cond3 = df['country'] =='United Kingdom'

In [197]:
len(df[cond1&cond2&cond3])

6

<hr>

In [199]:
import pandas as pd
train = pd.read_csv('./ch4_data/train.csv')
test = pd.read_csv('./ch4_data/test.csv')

In [205]:
target = train.pop("Segmentation")

,ID,Age,Work_Experience,Family_Size,Gender_Female,Gender_Male,Ever_Married_No,Ever_Married_Yes,Graduated_No,Graduated_Yes,...,Spending_Score_Average,Spending_Score_High,Spending_Score_Low,Var_1_Cat_1,Var_1_Cat_2,Var_1_Cat_3,Var_1_Cat_4,Var_1_Cat_5,Var_1_Cat_6,Var_1_Cat_7
0,458989,36,0.0,1.0,True,False,False,True,False,True,...,False,False,True,False,False,False,False,False,True,False
1,458994,37,8.0,4.0,False,True,False,True,False,True,...,True,False,False,False,False,False,False,False,True,False
2,459000,59,11.0,2.0,False,True,False,True,True,False,...,False,True,False,False,False,False,False,False,True,False
3,459003,47,0.0,5.0,False,True,False,True,False,True,...,False,True,False,False,False,False,True,False,False,False
4,459005,61,5.0,3.0,False,True,False,True,False,True,...,False,False,True,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2149,467950,35,1.0,2.0,True,False,True,False,False,True,...,False,False,True,False,False,False,False,False,True,False
2150,467954,29,9.0,4.0,False,True,True,False,True,False,...,False,False,True,False,False,False,False,False,True,False
2151,467958,35,1.0,1.0,True,False,True,False,False,True,...,False,False,True,False,False,False,False,False,True,False
2152,467961,47,1.0,5.0,False,True,False,True,False,True,...,False,True,False,False,False,False,True,False,False,False
2153,467968,43,9.0,3.0,True,False,True,False,False,True,...,False,False,True,False,False,False,False,False,False,True

In [208]:
train = pd.get_dummies(train)
test = pd.get_dummies(test)

In [209]:
from sklearn.model_selection import train_test_split

X_tr,X_val,y_tr,y_val = train_test_split(
    train, target, test_size = 0.2, random_state =0
)

In [211]:
from sklearn.metrics import f1_score
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier

In [214]:
lr = LogisticRegression()
model = lr.fit(X_tr,y_tr)
pred = lr.predict(X_val)
f1_score(y_val, pred,average='macro')

/Users/gihyun/Desktop/dev/GitHub/-BigDataAnalyst/.venv/lib/python3.13/site-packages/sklearn/linear_model/_logistic.py:473: ConvergenceWarning: lbfgs failed to converge after 100 iteration(s) (status=1):
STOP: TOTAL NO. OF ITERATIONS REACHED LIMIT

Increase the number of iterations to improve the convergence (max_iter=100).
You might also want to scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

0.33130502629966674

In [215]:
pred = lr.predict(test)

In [216]:
pred

array([4, 4, 1, ..., 4, 3, 1], shape=(2154,))

In [218]:
submit = pd.DataFrame({
    'ID':test['ID'],
    'Segmentation':pred
})

In [220]:
submit

          ID  Segmentation
0     458989             4
1     458994             4
2     459000             1
3     459003             3
4     459005             1
...      ...           ...
2149  467950             4
2150  467954             4
2151  467958             4
2152  467961             3
2153  467968             1

[2154 rows x 2 columns]

<hr>

In [234]:
import pandas as pd
df = pd.read_csv('./ch5_data/data5-1.csv')

In [235]:
cond1 = df["종량제봉투종류"] =='규격봉투'
cond2 = df["종량제봉투용도"] =='음식물쓰레기'
cond3 = df['2ℓ가격'] != 0

In [236]:
df = df[cond1&cond2&cond3]

In [237]:
round(df['2ℓ가격'].mean())

118

<hr>

In [239]:
import pandas as pd
df = pd.read_csv('./ch5_data/data5-2.csv')
df

      Gender  Height  Weight
0       Male   187.6   109.7
1       Male   174.7    73.6
2       Male   188.2    96.5
3       Male   182.2    99.8
4       Male   177.5    93.6
...      ...     ...     ...
9995  Female   168.1    62.0
9996  Female   170.4    77.5
9997  Female   162.2    58.3
9998  Female   175.3    74.3
9999  Female   157.3    51.6

[10000 rows x 3 columns]

In [240]:
df['bmi'] = df['Weight']/((df['Height']*0.01)**2)

In [241]:
df

      Gender  Height  Weight        bmi
0       Male   187.6   109.7  31.170298
1       Male   174.7    73.6  24.115263
2       Male   188.2    96.5  27.245079
3       Male   182.2    99.8  30.063102
4       Male   177.5    93.6  29.708391
...      ...     ...     ...        ...
9995  Female   168.1    62.0  21.940992
9996  Female   170.4    77.5  26.690857
9997  Female   162.2    58.3  22.159852
9998  Female   175.3    74.3  24.178257
9999  Female   157.3    51.6  20.854139

[10000 rows x 4 columns]

In [243]:
cond1 = df['bmi']>=18.5
cond2 = df['bmi']<23

A = df[cond1&cond2]
A

      Gender  Height  Weight        bmi
378     Male   167.2    63.3  22.642854
565     Male   156.9    56.0  22.747943
1942    Male   152.4    51.2  22.044489
2149    Male   171.7    67.8  22.997949
2341    Male   165.4    62.9  22.992153
...      ...     ...     ...        ...
9993  Female   152.5    44.3  19.048643
9994  Female   150.1    50.1  22.237007
9995  Female   168.1    62.0  21.940992
9997  Female   162.2    58.3  22.159852
9999  Female   157.3    51.6  20.854139

[1986 rows x 4 columns]

In [244]:
cond3 = df['bmi']>=23
cond4 = df['bmi']<25

B = df[cond3&cond4]
B

      Gender  Height  Weight        bmi
1       Male   174.7    73.6  24.115263
5       Male   170.8    69.0  23.652299
22      Male   168.0    67.7  23.986678
24      Male   172.4    73.5  24.729357
29      Male   174.0    70.0  23.120624
...      ...     ...     ...        ...
9986  Female   160.9    64.4  24.875612
9987  Female   166.7    68.6  24.686125
9988  Female   151.2    55.0  24.057977
9990  Female   160.5    64.1  24.883299
9998  Female   175.3    74.3  24.178257

[2130 rows x 4 columns]

In [245]:
print(round(abs(len(A)-len(B))))

144

<HR>

In [246]:
import pandas as pd
df = pd.read_csv('./ch5_data/data5-3.csv')

In [250]:
df['순전입학생'] = df['전입학생수(계)']-df['전출학생수(계)']

In [254]:
df = df.sort_values('순전입학생',ascending=False)

In [256]:
print(int(df.iloc[0,-2]))

230

<hr>

In [257]:
train = pd.read_csv('./ch5_data/train.csv')
test = pd.read_csv('./ch5_data/test.csv')

In [259]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3759 entries, 0 to 3758
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   model         3759 non-null   object
 1   year          3759 non-null   int64
 2   price         3759 non-null   int64
 3   transmission  3759 non-null   object
 4   mileage       3759 non-null   int64
 5   fuelType      3759 non-null   object
 6   tax           3759 non-null   int64
 7   mpg           3759 non-null   float64
 8   engineSize    3759 non-null   float64
dtypes: float64(2), int64(4), object(3)
memory usage: 264.4+ KB